Revit 2027 API
CoordinationModelLinkUtils.GetCoordinationModelTypeData Method
 Gets link data for the provided Coordination Model type.
Namespace: Autodesk.Revit.DB.ExternalData
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static CoordinationModelLinkData GetCoordinationModelTypeData(
	Document document,
	ElementType coordinationModelType
)
Public Shared Function GetCoordinationModelTypeData (
	document As Document,
	coordinationModelType As ElementType
) As CoordinationModelLinkData
public:
static CoordinationModelLinkData^ GetCoordinationModelTypeData(
	Document^ document,
	ElementType^ coordinationModelType
)
static member GetCoordinationModelTypeData :
        document : Document *
        coordinationModelType : ElementType -> CoordinationModelLinkData
Parameters
document Document
 The document.
coordinationModelType ElementType
 The Coordination Model type element.
Return Value
CoordinationModelLinkData
 Returns Coordination Model type data defining the link to the Autodesk Docs 3D view or the .nwc or .nwd file.
Exceptions
Exception | Condition
ArgumentException |  document is not a project document. -or- The element coordinationModelType was not found in the given document. -or- The provided element is not a Coordination Model type.
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements).
See Also
Reference
CoordinationModelLinkUtils Class
Autodesk.Revit.DB.ExternalData Namespace